teacherdayExplainJs = {
	init:function(){
		this.initPage();
	},initPage:function(){
		$(".ui-footer").remove();
		var params = mainJs.parseUrlSearch();
		var explain = '<p>活动说明：</p>'+
			'<p>“910”教师节感恩活动是创新学堂为了感恩天下“最美教师”，让每位同学送上对老师最好祝福的同时赠送给老师创新学堂平台910元的感恩金币。</p>'+
			'<p>1、填写老师的【姓名】和【祝福】，送祝福给您心中最敬爱、最美丽的老师。</p>'+
			'<p>2、分享到老师的微信，老师将收到你送上的祝福和创新学堂平台910元的感恩金币。</p>'+
			'<p>3、感恩金币老师可以在创新学堂平台金币专区购买精品课程，给老师带来健康与惊喜。</p>'+
			'<p>4、购买课程流程: 领取祝福—登陆平台—点击选课—金币专区—购买课程—金币支付。</p>'+
			'<p>5、祝福天下老师节日快乐，愿各位同学积极参与和分享更多给更多伙伴，送给老师最温馨的祝福。</p>'+
			'<p>6、活动时间:2015年9月10日当天，活动最终解释权归创新学堂所有。</p>';
		if(typeof (params.activity) != "undefined"){
			switch (params.activity){
				case '0':
				case '1':
					explain = '<p>活动说明：</p>'+
						'<p>“创业训练营—1001金币赠送”是创新学堂为了激励创业训练营中学员创新创业精神而发放的创新学堂金币奖励活动。</p>'+
						'<p>1、填写您要赠送的对象及一份温馨的祝福，将奖励金币分享给对方。</p>'+
						'<p>2、分享到的对方，在点击领取后获得创新学堂1001枚金币奖励。</p>'+
						'<p>3、奖励金币可以在创新学堂平台金币专区购买精品课程，完善学员的创新创业知识。</p>'+
						'<p>4、购买课程流程: 领取祝福—登陆平台—点击选课—金币专区—购买课程—金币支付。</p>'+
						'<p>5、当领取结束后活动停止。</p>'+
						'<p>6、创新学堂保有对本次活动的最终解释权。</p>';
					break;
			}
		}
		$(".dialog-mess").html(explain);
	}
};